[
{"title": "The Scoop - AI/ML Opportunities", "jobId": "3327136234", "companyName": "Apple", "location": "Cupertino, CA", "datePosted": "2022-11-17", "link": "https://www.linkedin.com/jobs/view/the-scoop-ai-ml-opportunities-at-apple-3327136234?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=yrr9HsII%2BizQqLANrGUQww%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   Discover Apple.  We’re looking for people like you.  Apple is a place where people from all backgrounds get together to do their life’s best work. Come join us. At Apple, great ideas have a way of becoming great products, services and customer experiences very quickly. Bring your passion to your job and there’s no telling what you could accomplish. Apple offers a collaborative work environment that fosters creativity and innovation.   Key Qualifications   Different together. At Apple, we’re not all the same. And that’s our greatest strength. We are looking for talented engineers across teams in AI/ML   Description   Machine Learning and AI The people working here in machine learning and AI are building amazing experiences into every Apple product, allowing millions to do what they never imagined. Because Apple fully integrates hardware and software across every device, these researchers and engineers collaborate more effectively to improve the user experience while protecting user data. Come make an impact with the products you create and the research you publish.   Role Number: 200435230 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Other", "industry": "Computers and Electronics Manufacturing"},
{"title": "AI Developer", "jobId": "3371038166", "companyName": "Compunnel Inc.", "location": "Richardson, TX", "datePosted": "2022-11-22", "link": "https://www.linkedin.com/jobs/view/ai-developer-at-compunnel-inc-3371038166?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=hqoKGqV1KlcwQL6bkxfxcA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description We are looking for a risk modeling professional to deliver client facing projects/engagements in quantitative model development projects including full development, re-development, calibration and fit for use assessment of models in the risk and regulatory area. This would involve application of various industry best practices and techniques in risk modeling including but not limited to linear/ logistic regression, time series methods, Markov chain, survival modelling and machine learning techniques. The selected candidate will work with leading banking clients to support varied model development needs in a fast-paced environment, bring in critical thinking, expertise in modeling and industry best practices. Works hands-on in development, re-development and calibration of risk and regulatory models, including but not limited to credit decision scorecards, Basel IRB - PD, LGD, EAD, Stress Testing, IFRS 9/CECL models, counter fraud and AML models, Responsibility Providing thought leadership and oversight for a team of risk modelers/validators Develop presentations to be shared with senior client management Data and quantitative analysis to support modeling decisions Leading development of model methodologies, algorithms and diagnostic tools for testing model robustness, sensitivity and stability Detailing model techniques and interpretation of variables used in the models to be documented and presented to client Stakeholders Validation for the source data quality, forecast data quality as well as change management End to end model development. Participation in assessment of compliance with regulatory needs, validation support, implementation support and testing plan Helping develop thorough technical documents for distribution and presentation to senior management, model developers, auditors and regulators Bringing in industry best practices and consultative inputs to help deliver continuous value to client engagements in advanced risk analytics Education:  Bachelors Degree\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "IT Services and IT Consulting"},
{"title": "Data Scientist/AI Engineer - US Fully Remote", "jobId": "3331500663", "companyName": "Within3", "location": "Minneapolis, MN", "datePosted": "2022-10-01", "link": "https://www.linkedin.com/jobs/view/data-scientist-ai-engineer-us-fully-remote-at-within3-3331500663?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=VT24psqzkzkJ1iGoyeTawA%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "The Within3 data science department has an opportunity for a mid level data science/AI software engineer. We have an expansive natural language processing project where we are summarizing the most common ideas expressed in datasets of captured text. This position will own unsupervised text clustering projects, including the underlying k-means clustering methodology, automating the identification of the optimal number of clusters inherent to a dataset, and performing such text clustering on text data We build our data science software primarily in Python, but may move to C or C++ as needed. We do not use R. All code must be written robustly and efficiently with good object oriented programming skills, not quick-and-dirty throwaway scripts, and pass code reviews. Writing efficient queries to databases, mostly Cypher/Neo4j and possibly SQL, will also be necessary. Strong communication skills, both verbal and written, are stressed on our team so that we can efficiently build our products and learn from each other in a professionally supportive business environment. Responsibilities : Research and develop the latest data science methodologies into proprietary software Develop and apply proprietary modeling software to build models with a multilayer perceptron, convolutional neural network, recurrent neural network, unsupervised training, language processing, and/or Word2Vec embeddings. Build and maintain graph databases that support customer applications Natural language processing Write and maintain excellent documentation of all work. Requirements Python development, object-oriented programming, and packaging Machine learning design, especially with TensorFlow Natural language processing Database skills, especially Cypher/Neo4j Linux/Unix Basic Software DevOps (Git, GitHub, version control, test harness development) Basic AWS - Familiarity with the AWS Management console and managing data in S3 buckets) Docker - All development is required to be done with Docker to maintain a consistent development environments Ability to formulate creative, original, scientific solutions Strong requisite math and statistics education: Vector calculus, linear algebra, probability theory, statistical modeling Strong technical writing skills will be heavily stressed Ph.D. in Computer Science, Math, Statistics, Physics, or closely related field strongly preferred Minimum 3 years of experience is required Preferred Skills: Managing automated testing in GitHub Actions Managing and using other AWS resources, such as EC2 instances and Lambda Functions Mathematical writing in LaTeX Lower-level language development, such as C/C++, may arise Relational database design/SQL Benefits 100% Remote  Health Care Plan (Medical, Dental & Vision) 401K Life Insurance Paid Time Off (Vacation, Sick & Public Holidays) A work/life balance beyond compare. And we mean it! Within3 is committed to creating a diverse and inclusive work environment and is proud to be an equal opportunity employer. We invite you to consider opportunities at Within3 regardless of your gender; gender identity; gender reassignment; age; religious or similar philosophical belief; race; national origin; political opinion; sexual orientation; disability; marital or civil partnership status or other non-merit factor. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Engineering", "industry": "Technology, Information and Internet"},
{"title": "AI/ML Software Architect - Early Career", "jobId": "3366355344", "companyName": "Lockheed Martin", "location": "King of Prussia, PA", "datePosted": "2022-11-22", "link": "https://www.linkedin.com/jobs/view/ai-ml-software-architect-early-career-at-lockheed-martin-3366355344?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=0xEsKKWLh%2BugEpfLWD5cyQ%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "COVID-19 continues to significantly impact our employees, families and communities. With employee health and safety as our top priority, and as a federal contractor, Lockheed Martin is taking action to address the increased risk and uncertainty COVID-19 variants pose in the workplace and ensuring we meet our commitments to national security. To uphold safety for all employees, we will continue to request vaccination status for all Lockheed Martin employees including new hires. All current and newly hired employees are required to follow onsite safety measures based upon the COVID-19 Community Level at the specific work location. Description: By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work. With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility. Your Mission is Ours. Lockheed Martin Space is seeking a full-time Early Career  AI/ML Software Architect . In this role, you will work on a cross-functional team alongside research engineers, data scientists, software developers, physicists, and mathematicians using cutting edge AI/ML tools and techniques to solve some of the hardest problems in Space - all in support of our national security. The successful candidate will have experience with and/or knowledge of: AI/ML, Deep Learning, or Computer Vision, modern software development practices/languages, and a passion for math and science. Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access. Basic Qualifications  Bachelor's degree in a STEM discipline (e.g. Electrical Engineering, Computer Science, Computer Engineering, Mathematics, Physics, etc.)  Knowledge of Artificial Intelligence, Machine Learning, Deep Learning, Computer Vision, or Image Processing  Familiarity with modern software development tools and practices  Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access. Desired Skills  Proficiency in one or more of the following programming languages: Python, Java, C++, or C#  Experience with DevSecOps  Experience with cloud computing platforms or services  Excellent written and verbal communication skills  Ability to work in a collaborative and team-based environment  Proficient with Microsoft Office Job.Qualifications BASIC QUALIFICATIONS: Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about. As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories. Experience Level 4 yr and up College \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Aviation and Aerospace Component Manufacturing"},
{"title": "AI/ML Research Engineer - Early Career", "jobId": "3364488984", "companyName": "Lockheed Martin", "location": "King of Prussia, PA", "datePosted": "2022-11-21", "link": "https://www.linkedin.com/jobs/view/ai-ml-research-engineer-early-career-at-lockheed-martin-3364488984?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=YRxjj0zj2vDaD4Hx5D77TQ%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "COVID-19 continues to significantly impact our employees, families and communities. With employee health and safety as our top priority, and as a federal contractor, Lockheed Martin is taking action to address the increased risk and uncertainty COVID-19 variants pose in the workplace and ensuring we meet our commitments to national security. To uphold safety for all employees, we will continue to request vaccination status for all Lockheed Martin employees including new hires. All current and newly hired employees are required to follow onsite safety measures based upon the COVID-19 Community Level at the specific work location. Description: By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work. With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility. Your Mission is Ours. Lockheed Martin Space is seeking a full-time Early Career  AI/ML Machine Learning Engineer . In this role, you will work on a cross-functional team alongside research engineers, data scientists, software developers, physicists, and mathematicians using cutting edge AI/ML tools and techniques to solve some of the hardest problems in Space - all in support of our national security. The successful candidate will have experience with and/or knowledge of: AI/ML, Deep Learning, or Computer Vision, modern software development practices/languages, and a passion for math and science. Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access. Basic Qualifications  Bachelor's degree in a STEM discipline (e.g. Electrical Engineering, Computer Science, Computer Engineering, Mathematics, Physics, etc.)  Knowledge of Artificial Intelligence, Machine Learning, Deep Learning, Computer Vision, or Image Processing  Research experience  Familiarity with modern software development tools and practices  Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access. Desired Skills  Proficiency in one or more of the following programming languages: Python, Java, C++, C#, or MATLAB  Experience with TensorFlow, PyTorch, Keras, or Scikit-learn  Excellent written and verbal communication skills  Ability to work in a collaborative and team-based environment  Proficient with Microsoft Office Job.Qualifications BASIC QUALIFICATIONS: Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about. As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories. Experience Level 4 yr and up College\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Aviation and Aerospace Component Manufacturing"},
{"title": "Data Scientist", "jobId": "3347667822", "companyName": "Insite AI", "location": "Bentonville, AR", "datePosted": "2022-10-12", "link": "https://www.linkedin.com/jobs/view/data-scientist-at-insite-ai-3347667822?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=%2B0YJDK6vfPmIM4ccuZABSA%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "We are looking for a Data Scientist to analyze large amounts of raw information to find patterns that will help improve our company. We will rely on you to build data products to extract valuable business insights. In this role, you should be highly analytical with a knack for analysis, math and statistics. Critical thinking and problem-solving skills are essential for interpreting data. We also want to see a passion for machine-learning and research. Your goal will be to help our company analyze trends to make better decisions. Requirements Process both structured and unstructured data, and analyze data to discover trends and patterns by exploring the data Build predictive models and machine learning algorithms and evaluate different models Build analytical solutions in the form of AI/ML product prototypes solving customer problems Present insights using data visualization techniques  Collaborate with engineering and product development teams to produce the developed AI model Bachelor’s degree or higher in a relevant analytical field with at least 2 years of relevant domain experience in retail and CPG  Skilled with data science programming in Python (pandas, writing classes, productionize the models) and SQL  Experience in Statistical Modeling and Machine Learning  Prototyping QA and testing Data Interpretation and Visualization  Presentation skills  Storytelling with data  Python, Cloud engineering, SQL, Basic ML algorithms, Experience with Transaction data and time series data. Simple UI's. Ability to understand large scale software & system architecture Able to communicate technical issues with technical & non-technical stakeholders Experience with Python ML tools: Pytorch, Tensorflow, Jupyter Notebooks, Pandas, scikit-learn, Numpy Experience with Spark Experience with UI: Flask, Plotly, Streamlit Understanding of Continuous integration, testing, deployment & release methodologies Experience in Kaggle participation Benefits Health Care Plan (Medical, Dental & Vision) Retirement Plan (401k, IRA) Life Insurance (Basic, Voluntary & AD&D) Paid Time Off (Vacation, Sick & Public Holidays) Remote - Work From Home Family Leave (Maternity, Paternity) Short Term & Long Term Disability Training & Development \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Technology, Information and Internet"},
{"title": "Junior Insights Analyst", "jobId": "3367157795", "companyName": "Signal AI", "location": "New York, United States", "datePosted": "2022-11-18", "link": "https://www.linkedin.com/jobs/view/junior-insights-analyst-at-signal-ai-3367157795?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=x140pT%2Bp4YEvO8imlOOKGQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "About Signal - Who are we? We're on a mission to change the way businesses make decisions with our cutting-edge AI technology. To achieve that, we’re looking for passionate people to join our open and unconventional workplace. Our inclusive environment welcomes skills and experiences from diverse backgrounds, and defines who we are. About the role - What’s your purpose? Signal AI x Kelp, the A.I.-powered platform for corporate reputation, is hiring a Junior Insights Analyst. In this pivotal role, you will help our CEO and C-suite clients at Fortune 500 companies measure and improve their companies’ reputation. You’ll turn our first-of-its-kind Reputation platform—which quantifies the reputation of hundreds of companies—into storytelling and reports that make corporations smarter and decisions easier. Your job is to work alongside our senior analysts to see what’s driving corporate reputation and contextualize the “why” behind the data. In this role, you’ll access our proprietary scoring engine, uncover the “signal in the noise” to explain those scores, and write insights reports for senior executives. It’s the perfect opportunity for people who love diving into the data, understand the exciting stories to tell, and know how to present them with wit and personality. You’ll operate like a hybrid between a data journalist from FiveThirtyEight and a strategy consultant from McKinsey. Salary band:  $85,000 to $95,000 Day-to-Day Responsibilities - What you will be doing?  You’ll work with Senior Analysts to dive into the nitty gritty of our proprietary data platform, generate ideas on opportunities and risks, get smart on complex industries, co-write reports, and deliver executive-level insights for our client pitches. Your core strength really is the ability to identify the signal from the noise to help shape compelling presentations for senior clients, evidenced by robust data. You will turn Signal AI x Kelp’s proprietary index—scoring hundreds of companies across hundreds of topics that define corporate reputation—into a storytelling platform (see our Signal AI 500 index here) You’ll work alongside our senior analysts to provide them with the data and insights they need to tell compelling stories for executive clients.  Above all, you will bring a passion for “a-ha!” moments and a keen sense of translating data into plain English. You’ll work closely with our new business teams to provide and present custom insights in our pitch decks, built to demonstrate the power of our product at a glance. Requirements Who are we looking for? You love transforming data into insights. You’ve likely spent the first 2+ years of your career at a research company, or in an analytics/strategy function at an agency or consultancy. You want to work on the next wave of insights, using transformational AI technology to drive business intelligence forward. You’re hungry to be part of a fast growing company that values entrepreneurship and initiative. Must-have skills:   Passion for diving into the data. We’ll provide you with the most advanced analytics suite to make sense of millions of data points—but you’ve got a roll-up-your-sleeves mentality: you enjoy looking for the data points that tell stories executives don’t already know.  A keen sense for copywriting to help editoriolize and “TL;DR” your research into business insights for C-Suite leaders. Excel and data literacy to “slice and dice” the data into your own pivot views Nice-to-have skills: PowerPoint skills to visualize and cogently convey your findings for our customers, bringing the data to life in a way that focuses attention on what matters. Familiarity with social listening / media monitoring tools Experience in PR analytics and recommendations  Don’t meet every single requirement listed? Academic research has shown that women or people of other underrepresented groups tend not to apply for jobs unless they meet every single qualification. At Signal AI, we know that diverse teams perform better so if your experience doesn’t fit perfectly but you’re excited about this role, we’d love for you to apply anyway. We’re committed to building and fostering an inclusive environment where Signallers feel welcomed, valued and listened to - an environment where they thrive being their true selves. Benefits Hybrid Working Environment - we have a hybrid remote policy with 2-3 days remote per week, plus Summer & Winter fully remote blocks wherever works for you, including abroad; Unlimited holiday entitlement; Share options;  Enhanced Maternity, Paternity and Dependents Leave policies; Full benefits and 401k/Citibike Membership; \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Associate", "employmentType": "Full-time", "jobFunction": "Research", "industry": "Technology, Information and Internet"},
{"title": "Machine Learning / AI Internship", "jobId": "3178548257", "companyName": "Apple", "location": "Cupertino, CA", "datePosted": "2022-10-17", "link": "https://www.linkedin.com/jobs/view/machine-learning-ai-internship-at-apple-3178548257?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=bgHsQiCaAn5%2BgIF1w079dA%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   Apple is seeking highly qualified people for the position of AI/ML Engineer and AI/ML Researcher. The team pursues research & development in the areas of machine learning (ML) with particular focus on deep learning (DL), computer vision (CV), Natural Language Processing (NLP), optimization, and reinforcement learning (RL). As a member of the team, ​you will work on some of the most ambitious technical problems, develop new ML solutions that will impact future Apple products, and collaborate with the best product teams to integrate your ideas into products. In addition, you will engage with the academic community by publishing your innovative research, and speaking at conferences and events.   Key Qualifications   You may meet or have interest in any one of the following qualifications:  In-depth expertise in deep learning (DL) and statistical machine learning (ML) Expertise in one or more of CV, NLP, optimization, RL, time series, generative models, signals, pattern recognition fields, and/or computer graphics fields Strong publication record demonstrating innovative research Good presentation skills Passionate about building extraordinary products Excellent programming skills in Java, Python, C/C++, CUDA or other GPGPU is a plus Knowledge of common ML frameworks Expected to perform well in a fast-paced environment, to execute on the tasks assigned, to meet the production deadlines and, at the same time, to explore independently new innovative ideas that can improve and transform the product experience of Apple customers Be able to deliver ML technologies aligned with the core values of Apple, ensuring the highest standards of quality, scientific rigor, innovation, and respect for user privacy Creative, collaborative, & product focused   Description   Some responsibilities in AI/ML may include: You will research and develop innovative ML strategies for challenging problems that will affect future Apple products. You will collaborate with broader teams across Apple to transfer AI/ML solutions. You will have opportunities to provide technical mentorship and guidance and prepare technical reports for publication and conference talks. You are self-motivated, excellent problem solver, a go-getter. You are quick to build relationships and work well with change and ambiguity. You have strong programming skills with tried experience crafting, prototyping, and delivering advanced algorithmic solutions.   Education & Experience   Pursuing PhD, Masters, or Bachelors degree in Machine Learning, Human Computer Interaction, Natural Language Processing, Robotics, Computer Science, Data Science, Statistics or related areas.   Role Number: 200389050 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"title": "AI/ML Specialist", "jobId": "3373768520", "companyName": "Pyramid Systems, Inc.", "location": "Fairfax, VA", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/ai-ml-specialist-at-pyramid-systems-inc-3373768520?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=kP3RQrINcNP8HzdRWsvmgA%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Currently seeking multiple AI/ML Specialist for potential new opportunty beginning January of 2023. Shall have a minimum of five (5) years of experience in the Information Technology field focusing on AI/ML development projects, DevSecOps and technical architecture specifically. Shall have experience with architecture & design experience, including at least three (3) years of experience deploying production enterprise applications in AWS that use AI/ML. Shall have experience with large scale,high performance enterprise big data application deployment and solution architecture on complex heterogeneous environments in AWS. Must be a US Citizen and able to sucessfully obtain and maintain a security clearance. Bachelor’s Degree in Computer Science, Engineering or related field preferred, however, experience in lieu of degree may be considered.  At least 5 years of professional experience as AI/ML work environment. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Other", "industry": "IT Services and IT Consulting"},
{"title": "AI Machine Learning Intern", "jobId": "3371242725", "companyName": "Leidos", "location": "Arlington, VA", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/ai-machine-learning-intern-at-leidos-3371242725?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=Q4yYyMrYeQ8Mj0qDqOuubQ%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Description Job Description: Leidos is offering a remote AI/ML Summer 2023 Internship out of our Arlington, VA office (virtual). This position is for an intern that is motivated to learn quickly. The candidate should be familiar with Python and have some experience with NumPy, Pandas, Matplotlib, Scikit Learn, Keras, Tensorflow, and Pytorch. The candidate must be intellectually adaptive, curious, good at expressing their needs, and able to manage themselves across their tasking. Selected candidates work alongside junior and senior software/system engineers and research/data scientists with expertise in multi-modal information retrieval, reinforcement learning, AI operations, ML operations, AI Cyber, graph analytics, using attention with transformers, natural language processing, adversarial machine learning, deep neural nets, ML model deployment, UI development, computer vision, metrics, information science, artificial intelligence, and autonomous systems. The applied nature of this research will ensure the AI/ML Summer interns’ hard work will impact the entire Leidos community and the mission-critical applications they serve. Primary Responsibilities Create AI/ML prototypes for use cases requiring identifying entities/objects, determining object association, object disambiguation, anomaly detection, state estimations, etc. Develop and maintain data models (both physical and logical) Perform extraction, transform, and load (ETL) tasks related to the different modalities and algorithms applied. This data ETL includes identifying the data's relevant metadata to ensure consistency, quality, accuracy, integrity, information assurance, and security. Packaging ML models into containers Conduct anomaly detection using various AI/ML techniques Use algorithms to identify complex patterns across multiple modalities Increase the efficiency and quality of data alignment and fusion Enhance and maintain analysis tools, including automation of current processes using AI/ML algorithms Direct quantitative data analysis, including developing retrieval, processing, fusion, analytics, and visualization of various datasets Configure and program prototypes Jupyter notebooks with ML solutions Setup and use AWS instances to train and operate AI/ML models Basic Qualifications Pursuing a Bachelor's or Master's Degree in Data Science, Computer Science, Artificial Intelligence, Mathematics, Statistics, Electrical Engineering, or Computer Engineering Must be eligible to obtain a DoD Top Secret security clearance with polygraph U.S. Citizenship required Practical experience with deep learning model creation/deployment Intermediate software development skills, including developing and maintaining code bases Hands-on Software Development Skills (Python-Preferred) Experience or educational courses/projects in Machine Learning Good understanding of machine learning algorithms, tools and platforms Experience in at least three of these Toolkits: NumPy, SciPy, scikit-learn, TensorFlow, Pytorch, Keras, Genism, vow pal wabbit, Stanford CoreNLP, , etc. Understanding of programming fundamentals Python proficiency Self-starter and intellectual curiosity Great communication skills, ability to explain predictive analytics to non-technical audience Proficiency in data exploration techniques and tools Preferred Qualifications Hands-on experience with prototype development Hands-on experience with automating data cleansing, formatting, staging, and transformation Hands-on experience reading and replicating code/ideas from published academic papers Hands-on experience applying data analytics Hands-on experience with Convolutional Neural Networks, Deep Neural Networks, Recurrent Neural Network, and Graph Neural Network Experience with the interpretability of deep learning models Experience in deep learning approaches to computer vision and natural language processing Pay Range Pay Range $42,250.00 - $65,000.00 - $87,750.00 The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law. #Remote\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Defense and Space Manufacturing"},
{"title": "AI/NLP Engineer", "jobId": "3371004655", "companyName": "Compunnel Inc.", "location": "Dallas, TX", "datePosted": "2022-11-22", "link": "https://www.linkedin.com/jobs/view/ai-nlp-engineer-at-compunnel-inc-3371004655?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=4s%2FnvCsxPsg7blraPBPbUA%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Minimum 8 years of experience with 5 + in the area of Artificial Intelligent and chatbot development Basic understanding of Artificial Intelligence(AI) including problem solving, natural-language processing. Must understand the basic chatbot concepts including the context, the topics, and the intents that define the conversation interaction, along with the associated utterances, entities, conditional logic and flow control patterns. Essential Engineering skills in any of known programming languages like Python, .net, java etc.: understanding data structures, functions, control structures, data manipulations, date and string manipulations, etc. Proficiency with frameworks such as Spacy, NLTK and basic libraries for machine learning such as scikit-learn and pandas Designing and development experience on Microsoft Azure Chatbot Design of Multi domain consumer-facing conversational experiences that are contextual, optimized and personalized using NLU/NLP systems such as Microsoft LUIS, QnA Maker, GCP Dialogflow, AWX lex Develop a deep understanding of customer personas, keeping their needs at the forefront of UX design to create highly personal experiences that drive customer confidence and product engagement Education:  Bachelors Degree\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "IT Services and IT Consulting"},
{"title": "AI Machine Learning Intern", "jobId": "3371245478", "companyName": "Leidos", "location": "Reston, VA", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/ai-machine-learning-intern-at-leidos-3371245478?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=7JsLD%2BDNsm0ujIRy%2BkF%2FzA%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Description Job Description: Leidos is offering a remote AI/ML Summer 2023 Internship out of our Arlington, VA office (virtual). This position is for an intern that is motivated to learn quickly. The candidate should be familiar with Python and have some experience with NumPy, Pandas, Matplotlib, Scikit Learn, Keras, Tensorflow, and Pytorch. The candidate must be intellectually adaptive, curious, good at expressing their needs, and able to manage themselves across their tasking. Selected candidates work alongside junior and senior software/system engineers and research/data scientists with expertise in multi-modal information retrieval, reinforcement learning, AI operations, ML operations, AI Cyber, graph analytics, using attention with transformers, natural language processing, adversarial machine learning, deep neural nets, ML model deployment, UI development, computer vision, metrics, information science, artificial intelligence, and autonomous systems. The applied nature of this research will ensure the AI/ML Summer interns’ hard work will impact the entire Leidos community and the mission-critical applications they serve. Primary Responsibilities Create AI/ML prototypes for use cases requiring identifying entities/objects, determining object association, object disambiguation, anomaly detection, state estimations, etc. Develop and maintain data models (both physical and logical) Perform extraction, transform, and load (ETL) tasks related to the different modalities and algorithms applied. This data ETL includes identifying the data's relevant metadata to ensure consistency, quality, accuracy, integrity, information assurance, and security. Packaging ML models into containers Conduct anomaly detection using various AI/ML techniques Use algorithms to identify complex patterns across multiple modalities Increase the efficiency and quality of data alignment and fusion Enhance and maintain analysis tools, including automation of current processes using AI/ML algorithms Direct quantitative data analysis, including developing retrieval, processing, fusion, analytics, and visualization of various datasets Configure and program prototypes Jupyter notebooks with ML solutions Setup and use AWS instances to train and operate AI/ML models Basic Qualifications Pursuing a Bachelor's or Master's Degree in Data Science, Computer Science, Artificial Intelligence, Mathematics, Statistics, Electrical Engineering, or Computer Engineering Must be eligible to obtain a DoD Top Secret security clearance with polygraph U.S. Citizenship required Practical experience with deep learning model creation/deployment Intermediate software development skills, including developing and maintaining code bases Hands-on Software Development Skills (Python-Preferred) Experience or educational courses/projects in Machine Learning Good understanding of machine learning algorithms, tools and platforms Experience in at least three of these Toolkits: NumPy, SciPy, scikit-learn, TensorFlow, Pytorch, Keras, Genism, vow pal wabbit, Stanford CoreNLP, , etc. Understanding of programming fundamentals Python proficiency Self-starter and intellectual curiosity Great communication skills, ability to explain predictive analytics to non-technical audience Proficiency in data exploration techniques and tools Preferred Qualifications Hands-on experience with prototype development Hands-on experience with automating data cleansing, formatting, staging, and transformation Hands-on experience reading and replicating code/ideas from published academic papers Hands-on experience applying data analytics Hands-on experience with Convolutional Neural Networks, Deep Neural Networks, Recurrent Neural Network, and Graph Neural Network Experience with the interpretability of deep learning models Experience in deep learning approaches to computer vision and natural language processing Pay Range Pay Range $42,250.00 - $65,000.00 - $87,750.00 The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law. #Remote\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Defense and Space Manufacturing"},
{"title": "AI/NLP Researcher", "jobId": "3364532151", "companyName": "Verneek", "location": "New York, United States", "datePosted": "2022-11-17", "link": "https://www.linkedin.com/jobs/view/ai-nlp-researcher-at-verneek-3364532151?refId=ZZlUVBXqq06cDnKzI27hYQ%3D%3D&trackingId=7yjPfxk4%2F91W8hvqUPOKuA%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Do you want to be part of the core team for building the next one-of-a-kind tech companies that can potentially change your career's trajectory?! We are striving to build the future of decision-making at Verneek. Come join us! If you are fed up with how little impact you are making at your current job despite all the hard work, if you are bored with your corporate job where you cannot learn or innovate anymore, or if you are simply not satisfied with your academic AI ambitions anymore,  Verneek could be a perfect opportunity for you: a new deep-tech AI startup, where you'd get to learn, innovate, and leave your mark every single day. We are looking for a stellar & highly ambitious AI/NLP researcher as one of the first employees to help build complex AI/NLP models supporting the Verneek AI platform! You'll get to work on fundamental AI research problems, but all grounded within the scope of our particular AI platform. It'll be all much more rewarding and influential than working on narrow AI benchmarks! :) Every day, you'll get to solve very unique, highly complex, and socially impactful problems. This is an early-stage startup, so we'll be moving super-fast and there will be no legacy obstacles on your way to make a significant impact. Whatever you do every hour of every day counts!! Responsibilities Design, implement, and maintain complex AI/NLP models supporting the Verneek AI platform Minimum Qualifications Requirements   MSc. or PhD degree in AI/NLP  4+ years of experience with Python Good grasp of fundamentals and the state-of-the-art in AI/NLP research 4+ years experience developing models with machine learning frameworks such as Tensorflow/PyTorch Work authorization in the USA at the time of hire Continuing work authorization during employment can be sponsored by Verneek Preferred Qualifications Experience in Natural Language Understanding, Semantic Parsing, Dialogue Systems Experience in Transfer Learning and learning with limited data Publications in top-tier AI venues such as ACL, EMNLP, NAACL, NeurIPS, ICLR, etc. Demonstrated AI/NLP engineering skillset through having deployed largescale AI/NLP systems to production At Verneek, we are very determined to build a company that promotes diversity of thought that comes from the diversity of the individuals on the team! Candidates from any gender identity, race, color, religion, sexual orientation, national origin, veteran, or disability status are highly encouraged to apply. Benefits Medical, dental, vision, disability, and life insurance 401K matching contributions Flexible PTO Career growth support through sponsoring learning opportunities and mentorship About Verneek Verneek is an early-stage deep-tech AI startup, based in the NYC area, founded by a team of leading AI research scientists and backed by a group of world-renowned business and AI leaders. Verneek recently closed its first round of financing and is now hiring its first ten employees, with tremendous growth & leadership opportunities. Verneek Mission Quintillion bytes of data get generated every day!! Leveraging this data for data-informed decision-making for societal, personal, and business matters is more viable and crucial than ever. Verneek's mission is to enable anyone to make better and faster decisions, be personal or business, without needing to have any technical background. Verneek Culture You can get a visual sense of our culture here :  https://www.verneek.com/culture . It’s often hard to put “culture” into words. We all absolutely love what we do, care about each other, share all sorts of meals together, celebrate all kinds of events together, and work tirelessly with the excitement of making a difference through technical innovation. We are enjoying the journey, and going through all the ups and downs together. We are building a truly different kind of a company where we put the well-being, career growth, and overall happiness of our team as our north star, through which we can deliver on our highly ambitious mission. We are determined to make sure that every individual’s career and life goals will be well aligned with their role at Verneek. We are striving to hit a balance between each employees’ personal growth and their productivity in their role. We firmly believe that everyone can hit their productivity stride when they are learning and growing every single day, working towards meaningful goals; which is the case at Verneek. We are just getting started! The initial core Verneek team will be playing a crucial role in shaping the culture of the company moving forward. We are looking for highly ambitious individuals who can take the lead in driving various aspects of the company, and help us shape its lasting culture.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Engineering", "industry": "Technology, Information and Internet"}